Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/problems_in_marriages_and_other_relationships/changing_your_name_by_deed_poll.html.txt.tmx
Source language: en
Languages: ga

source: Changing your name by deed poll
ga: D’ainm a athrú trí ghníomhas aonpháirtí

source: In Ireland, a deed poll is a signed declaration by a person that binds them to a particular course of action from the date of signing
ga: In Éirinn, is é is gníomhas aonpháirtí ann ná dearbhú sínithe ag duine lena gceanglaítear air/uirthi gníomh sonraithe a dhéanamh ó dháta an tsínithe ar aghaidh

source: A deed poll for a change of name contains declarations (in other words a sworn statement or affidavit) that you are abandoning the use of your old name, that you will use your new name at all times and that you require everyone to use your new name
ga: Is é atá i ngníomhas aonpháirtí le haghaidh athrú ainm ná dearbhuithe (is é sin, ráiteas faoi mhionn nó mionnscríbhinn) go bhfuil tú ag tréigean úsáid d’iar-ainm, go n-úsáidfidh tú d’ainm nua i gcónaí agus go n-éilíonn tú ar gach duine d’ainm nua a úsáid

source: Changing your name after marriage
ga: D’ainm a athrú tar éis pósadh

source: There is no legal or other obligation on anyone in Ireland to change their name on marriage
ga: Níl aon dualgas faoin dlí ná aon dualgas eile ar dhuine ar bith in Éirinn a (h)ainm a athrú tar éis pósadh

source: The fact that some people do, is purely based on tradition and culture
ga: Is fíor go n-athraíonn roinnt daoine a sloinne de bharr traidisiúin agus cultúir amháin

source: They may, for example, wish to signify they have joined a new family and therefore take the new name - but this is purely a social or cultural choice and has no legal basis
ga: D'fhéadfadh sé, mar shampla, go mbeidís ag cur in iúl go bhfuil siad tar éis ceangal le teaghlach nua agus go bhfuil siad ag glacadh leis an ainm nua dá bharr - ach is rogha shóisialta/ chultúrtha í sin amháin gan aon bhunús dlí léi

source: How you earn your name is by use and repute
ga: Is trí úsáid agus trí iomrá a thuilleann tú d’ainm

source: Effectively this means for most purposes, if someone wants to be known by their married name (or any other), then they just use this name and ask people to call them by it
ga: Mar sin, má bhíonn duine ag iarraidh go n-aithneofaí é/í de réir a s(h)loinne pósta (nó aon ainm eile), ní gá dó/di ach an t-ainm sin a úsáid agus iarraidh ar dhaoine eile é a thabhairt air nó uirthi

source: Changing the surname of a child
ga: Sloinne linbh a athrú

source: The surname of a child can be changed in the Register of Births but only in certain circumstances
ga: Is féidir sloinne an linbh a athrú ar Chlár na mBreitheanna ach ní dhéantar é sin ach amháin in imthosca speisialta

source: However, the surname of a child can also be changed by deed poll or common usage
ga: Mar sin féin, is féidir sloinne an linbh a athrú trí ghníomhas aonpháirtí nó trí úsáid choiteann

source: Children aged between 14 and 17 years can execute the Deed Poll themselves but need the consent of both parents
ga: Is féidir le leanaí atá idir 14 bliana d’aois agus 17 mbliana d’aois Gníomhas Aonpháirtí a fhorghníomhú iad féin, ach tá toiliú ón mbeirt tuismitheoirí ag teastáil

source: Where a child is under the age of 14 years, one of the child's parents must execute the Deed Poll with the consent of the other parent
ga: Sa chás go bhfuil an leanbh faoi bhun 14 bliana d’aois, ní mór do dhuine amháin de thuismitheoirí an linbh an Gníomhas Aonpháirtí a fhorghníomhú le toiliú an tuismitheora eile

source: The advantage of changing your name by deed poll is that you then have documentary evidence that you have changed your name
ga: Glactar leis an bhfianaise sin, in éineacht le do theastas breithe, i gcás fhormhór na nósanna imeachta riaracháin

source: This, along with your birth certificate, is acceptable for most administrative procedures and provides an easy and inexpensive solution to most of the difficulties that can arise when you change your name
ga: Dá bhrí sin, is réiteach éasca neamhchostasach iad ar fhormhór na deacrachtaí a d’fhéadfadh chun cinn nuair a athraíonn tú d’ainm

source: If you changed your name when you married, you do not need to execute a deed poll as you have your marriage certificate as evidence of your name change
ga: Má d’athraigh tú d’ainm nuair a phós tú, ní gá duit gníomhas aonpháirtí a ghníomhú toisc go mbeadh do theastas pósta mar fhianaise ar d’athrú ainm

source: Executing a deed poll
ga: Gníomhas aonpháirtí a fhorghníomhú

source: Execution of a deed poll is a relatively simple process
ga: Is próiseas réasúnta simplí é gníomhas aonpháirtí a fhorghníomhú

source: You can get a solicitor to do it or you can do it yourself
ga: Is féidir leat iarraidh ar aturnae é a dhéanamh nó is féidir leat féin é a dhéanamh

source: You declare that you have given up a former name and adopted a new name for all purposes
ga: Dearbhaíonn tú gur thréig tú iar-ainm agus gur ghlac tú le hainm nua chun gach críche

source: You sign the deed poll in the presence of a witness
ga: Síníonn tú an gníomhas aonpháirtí i láthair finné

source: The witness must also swear an affidavit (called an ‘affidavit of attesting witness’) before a solicitor or commissioner for oaths
ga: Ní mór don fhinné mionnscríbhinn (ar a dtugtar ‘mionnscríbhinn an fhinné atá ag fianú’) a mhionnú os comhair aturnae nó coimisinéir mionn freisin

source: See ‘How to apply’ below
ga: Féach ‘Conas iarratas a dhéanamh’ thíos

source: There is no requirement to enrol the deed poll in the Central Office of the High Court as, generally, it has no greater effect than a deed poll which has not been enrolled
ga: Níl aon cheanglas ar an ngníomhas aonpháirtí a rollú i bPríomh-Oifig na hArd-Chúirte mar gheall, go ginearálta, nach mbíonn tionchar níos mó aige ná gníomhas aonpháirtí nach ndearnadh a rollú

source: However, some organisations, such as the National Driving Licence Service (NDLS), will only accept a deed poll which has been enrolled
ga: Ní ghlacfaidh roinnt eagraíochtaí, áfach, ar nós na Seirbhíse Náisiúnta um Cheadúnas Tiomána (an NDLS), ach le gníomhas aonpháirtí a rinneadh a rollú

source: If you are applying for a gender recognition certificate and you wish to use a deed poll to change your name, your deed poll must be enrolled
ga: Má bhíonn iarratas á dhéanamh agat ar dheimhniú aitheantais inscne agus más mian leat gníomhas aonpháirtí a úsáid chun d’ainm a athrú, caithfear do ghníomhas aonpháirtí a rollú

source: The enrolment of a deed poll in the Central Office places your change of name on a publicly accessible record
ga: Déanann clárú an ghníomhais aonpháirtí d’athrú ainm a chur ar thaifead atá ar fáil don phobal

source: In addition, enrolling the deed poll means that a record of the change of name is preserved for future identification and a certified copy of the original enrolled deed poll can be obtained if required
ga: Ina theannta sin, sa chás go gcláraítear an gníomhas aonpháirtí, coinnítear taifead ar an athrú ainm sin le haghaidh aitheantas amach anseo agus is féidir cóip dheimhnithe den bhunghníomhas aonpháirtí cláraithe a fháil más gá

source: To enrol your deed poll you must attend in person
ga: Chun do ghníomhas aonpháirtí a chlárú, ní mór duit freastal i bpearsa

source: You will have to bring certain documentation as well as a completed application form
ga: Beidh ort doiciméid áirithe a thabhairt leat in éineacht le foirm iarratais chomhlánaithe

source: The application form includes an acknowledgement that enrolling the deed results in it being available for public inspection and published on the Courts Service website
ga: Admhaítear san fhoirm iarratais go mbeidh sí ar fáil lena himscrúdú poiblí agus go bhfoilseofar í ar láithreán Gréasáin na Seirbhíse Cúirteanna tar éis í a chlárú

source: You also have to pay stamp duty on the deed poll
ga: Beidh ort dleacht stampála a íoc i leith an ghníomhais aonpháirtí freisin

source: Change of name licence for non-EU nationals
ga: Ceadúnas athrú ainm do náisiúnaigh neamh-AE

source: Under Section 9 of the Aliens Act 1935, a non-EU national aged 18 or over must get a change of name licence from the Irish Naturalisation and Immigration Service (INIS) before executing a deed poll
ga: Faoi Alt 9 d’Acht na nEachtrannach, 1935, ní mór do dhuine nach náisiúnach den AE é/í atá 18 mbliana nó níos sine ceadúnas athrú ainm a fháil ó Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) sula bhforghníomhóidh sé/sí gníomhas aonpháirtí

source: You can obtain an application form for a change of name licence by writing to the Change of Name Section in INIS
ga: Is féidir leat foirm iarratais a fháil le haghaidh ceadúnas athrú ainm trí scríobh chuig an Rannóg um Athrú Ainm in SEIÉ

source: There is more information on change of name licences on the Irish Naturalisation and Immigration Service website
ga: Tugtar tuilleadh faisnéise ar cheadúnais athrú ainm ar láithreán Gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann

source: There is a small fee to have the affidavit of attesting witness sworn before a commissioner for oaths or a practising solicitor
ga: Gearrtar táille bheag ar mhionnscríbhinn an fhinné atá ag fianú a mhionnú os comhair coimisinéir mionn nó aturnae atá ag cleachtadh

source: There is no fixed rate of charges for legal fees, so you should enquire in advance for information on such charges
ga: Níl aon ráta seasta táillí ann i gcás táillí dlí. Mar sin, ba cheart duit faisnéis ar tháillí den sórt sin a iarraidh roimh ré

source: If you enroll the deed poll in the Central Office of the High Court, you will have to pay stamp duty of €60
ga: Má chláraíonn tú an gníomhas aonpháirtí i bPríomh-Oifig na hArd-Chúirte, beidh ort dleacht stampála €60 a íoc

source: To execute the deed poll, you can get a solicitor to do it or you can do it yourself
ga: Chun gníomhas aonpháirtí a fhorghníomhú, is féidir leat iarraidh ar aturnae é a dhéanamh nó is féidir leat féin é a dhéanamh

source: You can download a template of an adult deed poll from the Courts Service website
ga: Is féidir leat teimpléad de ghníomhas aonpháirtí fásta a íoslódáil ó láithreán Gréasáin na Seirbhíse Cúirteanna

source: The deed poll must be printed on deed paper (which is available from legal stationers)
ga: Ní mór an gníomhas a bheith priontáilte ar pháipéar gníomhais (atá ar fáil ó stáiseanóirí dlí)

source: You sign the deed poll in your old name and your new name
ga: Síníonn tú an gníomhas aonpháirtí i d’iar-ainm agus i d’ainm nua

source: You must sign it in the presence of a witness
ga: Ní mór duit é a shíniú i láthair finné

source: The witness must be at least 18 years of age
ga: Ní mór don fhinné bheith 18 mbliana d’aois ar a laghad

source: They must sign the deed poll as witness
ga: Ní mór dó/di an gníomhas aonpháirtí a shíniú mar fhinné

source: They must also swear an affidavit before a solicitor or commissioner for oaths stating that they witnessed the signing of the deed poll
ga: Ní mór dó/di mionnscríbhinn a mhionnú os comhair aturnae nó coimisinéir mionn freisin, agus iad ag lua gur fhianaigh sé/sí síniú an ghníomhais aonpháirtí

source: You can download a template of an affidavit of attesting witness from the Courts Service website
ga: Is féidir leat teimpléid de mhionnscríbhinn an fhinné atá ag fianú a íoslódáil ó láithreán Gréasáin na Seirbhíse Cúirteanna

source: There is a small fee for swearing the affidavit before a solicitor or commissioner for oaths
ga: Tá táille bheag a bhaineann leis an mionnscríbhinn a mhionnú os comhair aturnae nó coimisinéir mionn

source: If you want to change the name of a child by deed poll you should contact the Central Office of the High Court and ask for examples of the necessary documents
ga: Más mian leat a athrú ar an t-ainm an linbh trí ghníomhas ba chóir duit dul i dteagmháil leis an bPríomh-Oifig na hArd-Chúirte agus a iarraidh le haghaidh samplaí de na doiciméid is gá

source: There is no requirement to enrol the deed poll in the Central Office of the High Court as it has no greater effect than a deed poll which has not been enrolled
ga: Ní gá an gníomhas aonpháirtí a chlárú i bPríomh-Oifig na hArd-Chúirte toisc nach bhfuil sé níos éifeachtaí ar bhealach ar bith ná gníomhas aonpháirtí nach bhfuil cláraithe

source: If you do want to enrol your deed poll you must attend the Central Office in person
ga: Más mian leat do ghníomhas aonpháirtí a chlárú, ní mór duit freastal i bpearsa ar an bPríomh-Oifig

source: The service for personal callers to the Central Office is available on Tuesday and Thursday mornings, from 10.00am to 12.30pm
ga: Tá an tseirbhís do chuairteoirí i bpearsa ar an bPríomh-Oifig ar fáil maidineacha Dé Máirt agus Déardaoin ó 10.00am go 12.30pm

source: • The deed poll executed correctly
ga: • An gníomhas aonpháirtí a fhorghníomhú i gceart

source: • Evidence of your previous name (for example, a birth certificate, marriage certificate, previous name change by deed poll, certificate of naturalisation)
ga: • Fianaise ar d’iar-ainm a sholáthar (mar shampla, teastas breithe, teastas pósta, athrú ainm roimhe trí ghníomhas aonpháirtí, teastas eadóirseachta)

source: • A change of name licence (if you are a non-EU national)
ga: • Ceadúnas athrú ainm a sholáthar (murar náisiúnach an AE thú)

source: • Photographic proof of identification
ga: • Cruthúnas fótagrafach aitheantais a sholáthar

source: You have to complete an application form
ga: Ní mór duit foirm iarratais a chomhlánú

source: You can download an application form to enrol a deed poll from the Courts Service website
ga: Is féidir leat foirm iarratais chun clárú do ghníomhas aonpháirtí a íoslódáil ó láithreán Gréasáin na Seirbhíse Cúirteanna

source: Further information is available on the Courts Service website
ga: Tá tuilleadh faisnéise ar fáil ar láithreán Gréasáin na Seirbhíse Cúirteanna

source: Opening Hours:Personal callers Tuesdays and Thursdays 10.00am to 12.30pm
ga: Uaireanta Oscailte:Glaoiteoirí pearsanta Dé Máirt agus Déardaoin 10:00-12:30
